#include <bits/stdc++.h>

using namespace std;

int n,m;
char board[100][100];
int d[100][100];
vector<pair<int,int>> v;

int dx[] = {0,0,-1,1};
int dy[] = {1,-1,0,0};

int main(){
    cin >> m >> n;

    for(int i=0; i<n; i++){
        string s; cin >> s;
        for(int j=0; j<m; j++){
            board[i][j] = s[j];
            if(s[j] == 'C'){
                v.push_back({i,j});
            }
        }
    }

    for(auto dist : d) fill(dist, dist+m, INT_MAX);
    priority_queue<pair<int,tuple<int,int,int>>, vector<pair<int,tuple<int,int,int>>>, greater<pair<int,tuple<int,int,int>>>> pq;
    d[v[0].first][v[0].second]=0;
    pq.push({0,{v[0].first,v[0].second,-1}});

    int ex=-1,ey=-1, edist=-1;

    while(!pq.empty()){
        auto [cnt, node] = pq.top(); pq.pop();
        auto [x,y, dist] = node;
        
        int tx = ex, ty = ey, td = edist;
        ex = x;
        ey = y;
        edist = dist;

        if(d[x][y] != cnt)continue;
        if(tx == x && ty == y && td == dist) continue;

        // cout << x  << " " << y << " " << dist << endl;
        // for(int i=0; i<n; i++){
        //     for(int j=0; j<m; j++){
        //         if(d[i][j] == INT_MAX) cout << "*";
        //         else cout << d[i][j];
        //     }
        //     cout << endl;
        // }
        // cout << endl;

        for(int i=0; i<4; i++){
            int nx = x + dx[i];
            int ny = y + dy[i];
            if(nx < 0 || ny < 0 || nx >= n || ny >= m) continue;
            if(board[nx][ny] == '*') continue;

            if(dist == -1){
                d[nx][ny] = 0;
                pq.push({0,{nx,ny,i}});
            }
            else{
                int ad=0;
                if(dist != i) ad=1;

                if(d[nx][ny] >= d[x][y] + ad){
                    d[nx][ny] = d[x][y] + ad;
                    pq.push({d[nx][ny],{nx,ny,i}});

                }
            }
        }
    }

    cout << d[v[1].first][v[1].second];
}
//구조체로 pq 하면 어떻게 정렬될까 실험해보기
/*
반례
20 20
C...................
.*..................
..***...............
....*...............
...........*........
....................
.........*..........
.......*............
.........*..........
.....*..............
....*..*............
....*....*..........
....*.*.............
....*......*........
....*...............
....*...............
....*...............
....*...............
....*...............
*............C......

답1


100 7
...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*
C*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*.*
...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*
**************************************************************************************************.*
...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*
C*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*.*
...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*...*

답 196 시간초과문제
*/